DataProcessors/ОбработкаЗагруженыхРеквизитовЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?><MetaDataObject version="2.18">	<DataProcessor>		<InternalInfo>			<xr:GeneratedType name="DataProcessorObject.ќбработка«агруженых–еквизитов«аказов" category="Object">				<xr:TypeId>18f37d47-bb04-4b82-a1c5-05afab5270bd</xr:TypeId>				<xr:ValueId>007da509-074b-4659-93ef-2fbd3391e0e8</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="DataProcessorManager.ќбработка«агруженых–еквизитов«аказов" category="Manager">				<xr:TypeId>02e01ed3-21b2-481f-bf50-7a117a203874</xr:TypeId>				<xr:ValueId>40c1e7fc-7a4d-4eac-a352-4043eb67368d</xr:ValueId>			</xr:GeneratedType>		</InternalInfo>		<Properties>			<Name>ќбработка«агруженых–еквизитов«аказов</Name>			<Synonym>				<v8:item>					<v8:lang>ru</v8:lang>					<v8:content>ќбработка загруженых реквизитов заказов</v8:content>				</v8:item>			</Synonym>			<Comment/>			<UseStandardCommands>true</UseStandardCommands>			<DefaultForm/>			<AuxiliaryForm/>			<IncludeHelpInContents>false</IncludeHelpInContents>			<ExtendedPresentation/>			<Explanation/>		</Properties>		<ChildObjects>			<Attribute>				<Properties>					<Name>Ётоќбработкаќбменаƒанными</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Ёто обработка обмена данными</v8:content>						</v8:item>					</Synonym>					<Comment>фиктивный реквизит, наличие которого означает, что данна€ обработка сделана по технологии нетиповых обменов </Comment>					<Type>						<v8:Type>xs:string</v8:Type>						<v8:StringQualifiers>							<v8:Length>1</v8:Length>							<v8:AllowedLength>Variable</v8:AllowedLength>						</v8:StringQualifiers>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>				</Properties>			</Attribute>		</ChildObjects>	</DataProcessor></MetaDataObject>

InformationRegisters/ДополнительныеСвойстваЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?><MetaDataObject version="2.18">	<InformationRegister>		<InternalInfo>			<xr:GeneratedType name="InformationRegisterRecord.ДополнительныеСвойстваЗаказа" category="Record">				<xr:TypeId>a6d979ca-9631-4538-935b-7ec25cbe96fe</xr:TypeId>				<xr:ValueId>fc450f29-13ca-4da6-8579-d3e9e7651066</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterManager.ДополнительныеСвойстваЗаказа" category="Manager">				<xr:TypeId>92ee3c67-7082-4baa-b72b-63f8bfd63a63</xr:TypeId>				<xr:ValueId>3015d17f-80c7-44f4-bea3-5c2e8128d6af</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterSelection.ДополнительныеСвойстваЗаказа" category="Selection">				<xr:TypeId>fd2cac1f-9fdf-4d6d-af1d-ad1399f6e162</xr:TypeId>				<xr:ValueId>4ccb125b-6080-4d56-a137-d893547d447e</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterList.ДополнительныеСвойстваЗаказа" category="List">				<xr:TypeId>51340d0b-2cb1-4de9-8787-08240eecc095</xr:TypeId>				<xr:ValueId>07ac2fbe-7364-44ff-8fd0-9a2f0e8f214f</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterRecordSet.ДополнительныеСвойстваЗаказа" category="RecordSet">				<xr:TypeId>7a290b82-d0ed-4baf-8648-43a5031fb6fa</xr:TypeId>				<xr:ValueId>03f671c4-ac66-48c5-8c84-54fe1da610e2</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterRecordKey.ДополнительныеСвойстваЗаказа" category="RecordKey">				<xr:TypeId>86d227fa-e2e4-47f6-b8de-6e835b519315</xr:TypeId>				<xr:ValueId>f158cb97-c323-4a4d-a69c-030c1450f679</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterRecordManager.ДополнительныеСвойстваЗаказа" category="RecordManager">				<xr:TypeId>6837b622-aa2c-434a-8adb-1af7b8383066</xr:TypeId>				<xr:ValueId>7fa100e9-40ff-438d-9004-732474346fae</xr:ValueId>			</xr:GeneratedType>		</InternalInfo>		<Properties>			<Name>ДополнительныеСвойстваЗаказа</Name>			<Synonym>				<v8:item>					<v8:lang>ru</v8:lang>					<v8:content>Дополнительные свойства заказа</v8:content>				</v8:item>			</Synonym>			<Comment/>			<UseStandardCommands>true</UseStandardCommands>			<EditType>InDialog</EditType>			<DefaultRecordForm/>			<DefaultListForm/>			<AuxiliaryRecordForm/>			<AuxiliaryListForm/>			<StandardAttributes>				<xr:StandardAttribute name="Active">					<xr:LinkByType/>					<xr:FillChecking>DontCheck</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>				<xr:StandardAttribute name="LineNumber">					<xr:LinkByType/>					<xr:FillChecking>DontCheck</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>				<xr:StandardAttribute name="Recorder">					<xr:LinkByType/>					<xr:FillChecking>DontCheck</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>				<xr:StandardAttribute name="Period">					<xr:LinkByType/>					<xr:FillChecking>ShowError</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>			</StandardAttributes>			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>			<WriteMode>Independent</WriteMode>			<MainFilterOnPeriod>false</MainFilterOnPeriod>			<IncludeHelpInContents>false</IncludeHelpInContents>			<DataLockControlMode>Managed</DataLockControlMode>			<FullTextSearch>DontUse</FullTextSearch>			<EnableTotalsSliceFirst>false</EnableTotalsSliceFirst>			<EnableTotalsSliceLast>false</EnableTotalsSliceLast>			<RecordPresentation/>			<ExtendedRecordPresentation/>			<ListPresentation/>			<ExtendedListPresentation/>			<Explanation/>			<DataHistory>DontUse</DataHistory>			<UpdateDataHistoryImmediatelyAfterWrite>false</UpdateDataHistoryImmediatelyAfterWrite>			<ExecuteAfterWriteDataHistoryVersionProcessing>false</ExecuteAfterWriteDataHistoryVersionProcessing>		</Properties>		<ChildObjects>			<Resource>				<Properties>					<Name>Значение</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Значение</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыЗаказа</v8:TypeSet>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillFromFillingValue>false</FillFromFillingValue>					<FillValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks>						<xr:Link>							<xr:Name>Отбор.Владелец</xr:Name>							<xr:DataPath>InformationRegister.ДополнительныеСвойстваЗаказа.Dimension.Свойство</xr:DataPath>							<xr:ValueChange>Clear</xr:ValueChange>						</xr:Link>					</ChoiceParameterLinks>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<Indexing>DontIndex</Indexing>					<FullTextSearch>Use</FullTextSearch>					<DataHistory>Use</DataHistory>				</Properties>			</Resource>			<Dimension>				<Properties>					<Name>Заказ</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Заказ</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>cfg:CatalogRef.Заказы</v8:Type>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillFromFillingValue>true</FillFromFillingValue>					<FillValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<Master>true</Master>					<MainFilter>true</MainFilter>					<DenyIncompleteValues>false</DenyIncompleteValues>					<Indexing>DontIndex</Indexing>					<FullTextSearch>Use</FullTextSearch>					<DataHistory>Use</DataHistory>					<TypeReductionMode>TransformValues</TypeReductionMode>				</Properties>			</Dimension>			<Dimension>				<Properties>					<Name>Свойство</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Свойство</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыЗаказа</v8:Type>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillFromFillingValue>false</FillFromFillingValue>					<FillValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<Master>false</Master>					<MainFilter>true</MainFilter>					<DenyIncompleteValues>false</DenyIncompleteValues>					<Indexing>DontIndex</Indexing>					<FullTextSearch>Use</FullTextSearch>					<DataHistory>Use</DataHistory>					<TypeReductionMode>TransformValues</TypeReductionMode>				</Properties>			</Dimension>		</ChildObjects>	</InformationRegister></MetaDataObject>

Enums/СтатусыЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?><MetaDataObject version="2.18">	<Enum>		<InternalInfo>			<xr:GeneratedType name="EnumRef.СтатусыЗаказа" category="Ref">				<xr:TypeId>bd73c52a-3fad-460b-8c21-09a0a2bfa583</xr:TypeId>				<xr:ValueId>ef11c893-f98e-40a8-8a45-76a939101318</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="EnumManager.СтатусыЗаказа" category="Manager">				<xr:TypeId>106fd197-f57d-4835-88d7-0ed57d8c52f1</xr:TypeId>				<xr:ValueId>927f5151-ed9d-4d7a-8654-97c911a1ecb3</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="EnumList.СтатусыЗаказа" category="List">				<xr:TypeId>3e3cdd13-28ae-4d93-84f9-fe99314d33f8</xr:TypeId>				<xr:ValueId>12cdfe99-0381-4365-9fc3-70da09a7ed2b</xr:ValueId>			</xr:GeneratedType>		</InternalInfo>		<Properties>			<Name>СтатусыЗаказа</Name>			<Synonym>				<v8:item>					<v8:lang>ru</v8:lang>					<v8:content>Статусы заказа</v8:content>				</v8:item>			</Synonym>			<Comment/>			<UseStandardCommands>false</UseStandardCommands>			<Characteristics/>			<QuickChoice>true</QuickChoice>			<ChoiceMode>BothWays</ChoiceMode>			<DefaultListForm/>			<DefaultChoiceForm/>			<AuxiliaryListForm/>			<AuxiliaryChoiceForm/>			<ListPresentation/>			<ExtendedListPresentation/>			<Explanation/>			<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>		</Properties>		<ChildObjects>			<EnumValue>				<Properties>					<Name>A</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>A</v8:content>						</v8:item>					</Synonym>					<Comment/>				</Properties>			</EnumValue>			<EnumValue>				<Properties>					<Name>B</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>B</v8:content>						</v8:item>					</Synonym>					<Comment/>				</Properties>			</EnumValue>			<EnumValue>				<Properties>					<Name>C</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>C</v8:content>						</v8:item>					</Synonym>					<Comment/>				</Properties>			</EnumValue>		</ChildObjects>	</Enum></MetaDataObject>

DataProcessors/ОбработкаЗагруженыхРеквизитовЗаказов/Ext/ManagerModule.bsl
Функция ПолучитьОписаниеОбработкиОбмена() Экспорт

	// полный состав параметров описания смотри в этой функции
	СтруктураНастроек = Справочники.НетиповыеОбменыДанными.ПолучитьОписаниеОбработкиОбменаПоУмолчанию();
	СтруктураНастроек.ТекстовоеОписаниеОбмена = "Обработка загруженных реквизитов автомобилей";
	СтруктураНастроек.ВидОбмена = Перечисления.ВидыОбмена.Загрузка;
	СтруктураНастроек.СпособПередачиДанных = Перечисления.СпособыПередачиДанныхВНетиповыхОбменах.None;
	СтруктураНастроек.ИспользованиеРегламентогоЗадания = Истина;
	СтруктураНастроек.ИспользованиеРегистрацииДанныхНаУзлеНетиповогоОбмена = Истина;
	
	Возврат СтруктураНастроек;
КонецФункции // ()

Функция ВыполнитьОбмен(Событие, НастройкаОбмена) Экспорт
	
	МассивТекстовОшибок = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаполнениеРеквизитовЗаказовХарактеристикиVIN.Ссылка КАК ДокументСсылка,
	|	ЗаполнениеРеквизитовЗаказовХарактеристикиVIN.Ссылка.ВходящийНомер КАК ДокументНомер,
	|	ЗаполнениеРеквизитовЗаказовХарактеристикиVIN.Ссылка.Дата КАК ДокументДата,
	|	ЗаполнениеРеквизитовЗаказовХарактеристикиVIN.Заказ_VIN КАК Заказ_VIN,
	|	ЗаполнениеРеквизитовЗаказовХарактеристикиVIN.Характеристика_Имя КАК Характеристика_Имя,
	|	ЗаполнениеРеквизитовЗаказовХарактеристикиVIN.Значение_Характеристики КАК Значение_Характеристики,
	|	ЕСТЬNULL(Заказы.Ссылка, ЗНАЧЕНИЕ(Справочник.Заказы.ПустаяСсылка)) КАК Заказ_Ссылка
	|ИЗ
	|	Документ.ЗаполнениеРеквизитовЗаказов.Изменения КАК ЗаполнениеРеквизитовЗаказовИзменения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаполнениеРеквизитовЗаказов.ХарактеристикиVIN КАК ЗаполнениеРеквизитовЗаказовХарактеристикиVIN
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Заказы КАК Заказы
	|			ПО ЗаполнениеРеквизитовЗаказовХарактеристикиVIN.Заказ_VIN = Заказы.VIN
	|		ПО ЗаполнениеРеквизитовЗаказовИзменения.Ссылка = ЗаполнениеРеквизитовЗаказовХарактеристикиVIN.Ссылка
	|ГДЕ
	|	ЗаполнениеРеквизитовЗаказовИзменения.Узел = &Узел
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументДата,
	|	ДокументНомер
	|ИТОГИ
	|	МАКСИМУМ(Заказ_Ссылка)
	|ПО
	|	ДокументСсылка,
	|	Заказ_VIN";
	
	Запрос.УстановитьПараметр("Узел", НастройкаОбмена.УзелРегистрацииИзменений);

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДокумент = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДокумент.Следующий() Цикл
		
		ВыборкаЗаказ = ВыборкаДокумент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		НачатьТранзакцию();
		
		Попытка
			
			Пока ВыборкаЗаказ.Следующий() Цикл
				
				Заказ_Ссылка = ВыборкаЗаказ.Заказ_Ссылка;
				Если Заказ_Ссылка = Справочники.Заказы.ПустаяСсылка() Тогда
					ЗаказОбъект = Справочники.Заказы.СоздатьЭлемент();
					ЗаказОбъект.Наименование = ВыборкаЗаказ.Заказ_VIN;
					ЗаказОбъект.VIN = ВыборкаЗаказ.Заказ_VIN;    
					
					//чтобы добавлять характеристики, определим новую ссылку для объекта
					//(можно было сделать: ЗаказОбъект.Записать();)
					НоваяСсылка = Справочники.Заказы.ПолучитьСсылку(Новый УникальныйИдентификатор);
        			ЗаказОбъект.УстановитьСсылкуНового(НоваяСсылка);
					
					ДокИзменениеСтатуса = Документы.ИзменениеСтатусаЗаказа.СоздатьДокумент();
					ДокИзменениеСтатуса.Дата = ТекущаяДатаСеанса();
					ДокИзменениеСтатуса.Заказ = НоваяСсылка;
					ДокИзменениеСтатуса.Статус = Перечисления.СтатусыЗаказа.A;
					ДокИзменениеСтатуса.Записать(РежимЗаписиДокумента.Проведение);
				Иначе
					ЗаказОбъект = Заказ_Ссылка.ПолучитьОбъект();
				КонецЕсли;
							
				Выборка = ВыборкаЗаказ.Выбрать();
				Пока Выборка.Следующий() Цикл
					Если Выборка.Характеристика_Имя = "Модель" Тогда
						ЗаказОбъект.Модель = НайтиСоздатьСправочник("Модели", Выборка.Значение_Характеристики);
					ИначеЕсли Выборка.Характеристика_Имя = "Цвет" Тогда
						ЗаказОбъект.Цвет = НайтиСоздатьСправочник("Цвета", Выборка.Значение_Характеристики);
					ИначеЕсли Выборка.Характеристика_Имя = "Бренд" Тогда
						Если ЗначениеЗаполнено(Выборка.Значение_Характеристики) Тогда
							ЗаказОбъект.Бренд = НайтиСоздатьСправочник("Бренды", Выборка.Значение_Характеристики);
						КонецЕсли;  
					ИначеЕсли ВРЕГ(Выборка.Характеристика_Имя) = "VIN" Тогда
						//Пропускаем	
					Иначе
						ДобавитьХарактеристику(ЗаказОбъект.Ссылка,Выборка.Характеристика_Имя,Выборка.Значение_Характеристики);
					КонецЕсли;
				КонецЦикла;
				ЗаказОбъект.Записать();
				
			КонецЦикла;

			ПланыОбмена.УдалитьРегистрациюИзменений(НастройкаОбмена.УзелРегистрацииИзменений, ВыборкаДокумент.ДокументСсылка);
			
		Исключение
			ОтменитьТранзакцию();
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ТекстОшибкиПоДокументу = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Ошибка при обработке документа ""%1"": %2'"), ВыборкаДокумент.ДокументСсылка, КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
			МассивТекстовОшибок.Добавить(ТекстОшибкиПоДокументу);
			Продолжить;
		КонецПопытки;
		
		ЗафиксироватьТранзакцию();
		
	КонецЦикла;
	
	ТекстОшибки = СтрСоединить(МассивТекстовОшибок, Символы.ПС);
	Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
		РегистрыСведений.СОЛЛЕРС_ЖурналРегистрацииСобытий.ЗафиксироватьИнформационноеСообщение(Событие, Перечисления.СОЛЛЕРС_УровниСобытия.Ошибка, ТекстОшибки);
	КонецЕсли;
		
	Возврат "";
	
КонецФункции // ()

Функция НайтиСоздатьСправочник(ТипСправочника, Наименование)
	
	СправочникСсылка = Справочники[ТипСправочника].НайтиПоНаименованию(Наименование, Истина);
	
	Если СправочникСсылка = Справочники[ТипСправочника].ПустаяСсылка() Тогда
		СправочникОбъект = Справочники[ТипСправочника].СоздатьЭлемент();
		СправочникОбъект.Наименование = Наименование;
		СправочникОбъект.Записать();
		СправочникСсылка = СправочникОбъект.Ссылка;
	КонецЕсли;
	
	Возврат СправочникСсылка;
	
КонецФункции    

Процедура ДобавитьХарактеристику(Заказ,ХарактеристикаИмя,ХарактеристикаЗначение)
	
	Если Не ЗначениеЗаполнено(ХарактеристикаИмя) Тогда
		Возврат;	
	КонецЕсли;

	//Все характеристики одного типа ЗначениеСвойствЗаказа
	//Если ХарактеристикаЗначение не заполнено, то соответствующее свойство сбрасывается
	
	НаименованиеХарактеристики 			= Лев(ХарактеристикаИмя,Метаданные.ПланыВидовХарактеристик.ДополнительныеРеквизитыЗаказа.ДлинаНаименования);
	НаименованиеЗначенияХарактеристики 	= Лев(ХарактеристикаЗначение,Метаданные.Справочники.ЗначениеСвойствЗаказа.ДлинаНаименования);
	
	Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыЗаказа.НайтиПоНаименованию(НаименованиеХарактеристики,Истина);
	//Все характеристики одного типа ЗначениеСвойствЗаказа
	Если Не ЗначениеЗаполнено(Свойство) Тогда
		НоваяХарактеристика = ПланыВидовХарактеристик.ДополнительныеРеквизитыЗаказа.СоздатьЭлемент();
		НоваяХарактеристика.Наименование = НаименованиеХарактеристики;
		НоваяХарактеристика.ТипЗначения	= Новый ОписаниеТипов("СправочникСсылка.ЗначениеСвойствЗаказа");
		НоваяХарактеристика.Записать();  
		Свойство = НоваяХарактеристика.Ссылка; 
	КонецЕсли;

	ЗначениеСвойства = Справочники.ЗначениеСвойствЗаказа.НайтиПоНаименованию(НаименованиеЗначенияХарактеристики,Истина,,Свойство);
	//Если ХарактеристикаЗначение не заполнено, то соответствующее свойство сбрасывается	
	Если Не ЗначениеЗаполнено(ЗначениеСвойства) 
		И ЗначениеЗаполнено(НаименованиеЗначенияХарактеристики) Тогда
		НовоеЗначениеСвойства = Справочники.ЗначениеСвойствЗаказа.СоздатьЭлемент();
		НовоеЗначениеСвойства.Наименование 	= НаименованиеЗначенияХарактеристики;
		НовоеЗначениеСвойства.Владелец 		= Свойство; 
		НовоеЗначениеСвойства.Записать();
		ЗначениеСвойства = НовоеЗначениеСвойства.Ссылка;
	КонецЕсли;

	МенеджерЗаписи = РегистрыСведений.ДополнительныеСвойстваЗаказа.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Заказ = Заказ;
	МенеджерЗаписи.Свойство = Свойство;
	МенеджерЗаписи.Значение = ЗначениеСвойства;
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры
